sample/hr/swarm-hr-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-client1-t4-c512-d30-R2500
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=2500
Running 30s test @ http://10.10.1.7:5000
  4 threads and 512 connections
  Thread calibration: mean lat.: 198.529ms, rate sampling interval: 1704ms
  Thread calibration: mean lat.: 226.863ms, rate sampling interval: 2032ms
  Thread calibration: mean lat.: 202.702ms, rate sampling interval: 1656ms
  Thread calibration: mean lat.: 225.892ms, rate sampling interval: 1984ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.69s     3.51s   14.97s    61.39%
    Req/Sec   277.40     42.68   364.00     69.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.59s 
 75.000%   10.46s 
 90.000%   12.45s 
 99.000%   14.97s 
 99.900%   16.08s 
 99.990%   16.55s 
 99.999%   16.97s 
100.000%   16.97s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.199     0.000000            1         1.00
    2889.727     0.100000         2210         1.11
    4218.879     0.200000         4418         1.25
    5505.023     0.300000         6630         1.43
    6541.311     0.400000         8838         1.67
    7593.983     0.500000        11045         2.00
    8146.943     0.550000        12157         2.22
    8699.903     0.600000        13264         2.50
    9265.151     0.650000        14362         2.86
    9879.551     0.700000        15472         3.33
   10461.183     0.750000        16580         4.00
   10756.095     0.775000        17129         4.44
   11059.199     0.800000        17673         5.00
   11395.071     0.825000        18225         5.71
   11730.943     0.850000        18776         6.67
   12083.199     0.875000        19338         8.00
   12271.615     0.887500        19610         8.89
   12451.839     0.900000        19888        10.00
   12673.023     0.912500        20164        11.43
   12902.399     0.925000        20439        13.33
   13148.159     0.937500        20716        16.00
   13295.615     0.943750        20850        17.78
   13459.455     0.950000        20989        20.00
   13606.911     0.956250        21126        22.86
   13778.943     0.962500        21263        26.67
   13983.743     0.968750        21398        32.00
   14090.239     0.971875        21473        35.56
   14204.927     0.975000        21539        40.00
   14327.807     0.978125        21608        45.71
   14442.495     0.981250        21675        53.33
   14606.335     0.984375        21746        64.00
   14680.063     0.985938        21778        71.11
   14778.367     0.987500        21812        80.00
   14901.247     0.989062        21849        91.43
   14983.167     0.990625        21882       106.67
   15114.239     0.992188        21918       128.00
   15163.391     0.992969        21933       142.22
   15261.695     0.993750        21950       160.00
   15359.999     0.994531        21970       182.86
   15425.535     0.995313        21985       213.33
   15540.223     0.996094        22002       256.00
   15605.759     0.996484        22011       284.44
   15671.295     0.996875        22019       320.00
   15736.831     0.997266        22028       365.71
   15802.367     0.997656        22038       426.67
   15843.327     0.998047        22045       512.00
   15908.863     0.998242        22051       568.89
   15958.015     0.998437        22055       640.00
   15974.399     0.998633        22058       731.43
   16039.935     0.998828        22063       853.33
   16097.279     0.999023        22067      1024.00
   16138.239     0.999121        22070      1137.78
   16146.431     0.999219        22071      1280.00
   16236.543     0.999316        22073      1462.86
   16285.695     0.999414        22076      1706.67
   16326.655     0.999512        22079      2048.00
   16326.655     0.999561        22079      2275.56
   16351.231     0.999609        22080      2560.00
   16367.615     0.999658        22081      2925.71
   16441.343     0.999707        22082      3413.33
   16482.303     0.999756        22083      4096.00
   16523.263     0.999780        22084      4551.11
   16523.263     0.999805        22084      5120.00
   16531.455     0.999829        22085      5851.43
   16531.455     0.999854        22085      6826.67
   16547.839     0.999878        22086      8192.00
   16547.839     0.999890        22086      9102.22
   16547.839     0.999902        22086     10240.00
   16957.439     0.999915        22087     11702.86
   16957.439     0.999927        22087     13653.33
   16957.439     0.999939        22087     16384.00
   16957.439     0.999945        22087     18204.44
   16957.439     0.999951        22087     20480.00
   16973.823     0.999957        22088     23405.71
   16973.823     1.000000        22088          inf
#[Mean    =     7689.570, StdDeviation   =     3511.712]
#[Max     =    16957.440, Total count    =        22088]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  40342 requests in 30.08s, 16.70MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:   1341.06
Transfer/sec:    568.34KB