sample/hr/swarm-hr-wrk-mixed-c6525-25g-exp13-havail0-hori1-verti0-infi1-client1-t4-c512-d30-R10000
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=10000
Running 30s test @ http://10.10.1.4:5000
  4 threads and 512 connections
  Thread calibration: mean lat.: 3091.004ms, rate sampling interval: 11829ms
  Thread calibration: mean lat.: 3104.007ms, rate sampling interval: 11821ms
  Thread calibration: mean lat.: 3067.064ms, rate sampling interval: 11206ms
  Thread calibration: mean lat.: 3127.525ms, rate sampling interval: 11976ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.38s     4.04s   20.76s    58.65%
    Req/Sec   788.25      4.02   794.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.26s 
 75.000%   16.86s 
 90.000%   18.94s 
 99.000%   20.76s 
 99.900%   21.77s 
 99.990%   22.84s 
 99.999%   23.25s 
100.000%   23.27s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5369.855     0.000000            1         1.00
    7872.511     0.100000         6252         1.11
    9297.919     0.200000        12504         1.25
   10592.255     0.300000        18753         1.43
   11902.975     0.400000        25031         1.67
   13262.847     0.500000        31264         2.00
   14008.319     0.550000        34390         2.22
   14729.215     0.600000        37497         2.50
   15433.727     0.650000        40647         2.86
   16146.431     0.700000        43752         3.33
   16859.135     0.750000        46893         4.00
   17219.583     0.775000        48465         4.44
   17563.647     0.800000        49999         5.00
   17907.711     0.825000        51545         5.71
   18268.159     0.850000        53135         6.67
   18595.839     0.875000        54688         8.00
   18776.063     0.887500        55481         8.89
   18956.287     0.900000        56294        10.00
   19120.127     0.912500        57047        11.43
   19300.351     0.925000        57832        13.33
   19480.575     0.937500        58606        16.00
   19578.879     0.943750        58982        17.78
   19677.183     0.950000        59363        20.00
   19791.871     0.956250        59745        22.86
   19922.943     0.962500        60143        26.67
   20054.015     0.968750        60535        32.00
   20135.935     0.971875        60744        35.56
   20217.855     0.975000        60929        40.00
   20299.775     0.978125        61115        45.71
   20398.079     0.981250        61316        53.33
   20512.767     0.984375        61525        64.00
   20578.303     0.985938        61622        71.11
   20643.839     0.987500        61725        80.00
   20692.991     0.989062        61797        91.43
   20791.295     0.990625        61897       106.67
   20889.599     0.992188        62001       128.00
   20922.367     0.992969        62040       142.22
   20987.903     0.993750        62095       160.00
   21053.439     0.994531        62145       182.86
   21118.975     0.995313        62200       213.33
   21168.127     0.996094        62239       256.00
   21200.895     0.996484        62260       284.44
   21266.431     0.996875        62284       320.00
   21331.967     0.997266        62310       365.71
   21397.503     0.997656        62335       426.67
   21446.655     0.998047        62356       512.00
   21495.807     0.998242        62369       568.89
   21561.343     0.998437        62383       640.00
   21626.879     0.998633        62394       731.43
   21659.647     0.998828        62405       853.33
   21790.719     0.999023        62420      1024.00
   21823.487     0.999121        62424      1137.78
   21839.871     0.999219        62430      1280.00
   21889.023     0.999316        62439      1462.86
   21921.791     0.999414        62442      1706.67
   22003.711     0.999512        62450      2048.00
   22020.095     0.999561        62452      2275.56
   22036.479     0.999609        62454      2560.00
   22069.247     0.999658        62457      2925.71
   22134.783     0.999707        62461      3413.33
   22167.551     0.999756        62463      4096.00
   22265.855     0.999780        62465      4551.11
   22298.623     0.999805        62466      5120.00
   22347.775     0.999829        62468      5851.43
   22478.847     0.999854        62469      6826.67
   22659.071     0.999878        62471      8192.00
   22839.295     0.999890        62472      9102.22
   22839.295     0.999902        62472     10240.00
   23003.135     0.999915        62473     11702.86
   23052.287     0.999927        62474     13653.33
   23085.055     0.999939        62475     16384.00
   23085.055     0.999945        62475     18204.44
   23085.055     0.999951        62475     20480.00
   23216.127     0.999957        62476     23405.71
   23216.127     0.999963        62476     27306.67
   23248.895     0.999969        62477     32768.00
   23248.895     0.999973        62477     36408.89
   23248.895     0.999976        62477     40960.00
   23248.895     0.999979        62477     46811.43
   23248.895     0.999982        62477     54613.33
   23265.279     0.999985        62478     65536.00
   23265.279     1.000000        62478          inf
#[Mean    =    13382.422, StdDeviation   =     4035.201]
#[Max     =    23248.896, Total count    =        62478]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  94595 requests in 30.00s, 39.12MB read
Requests/sec:   3153.23
Transfer/sec:      1.30MB